Расширение_ЛаРС_Доработки_Бух/Documents/ЛаРС_РеестрОплатыИсков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛаРС_РеестрОплатыИсков</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>450</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежноеПоручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодЗадолженности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>21</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Расширение_ЛаРС_Доработки_Бух/Documents/ЛаРС_РеестрОплатыИсков/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
   Макет = Документы.ЛаРС_РеестрОплатыИсков.ПолучитьМакет("ПФ_MXL_РеестрОплатыИсков");
   Запрос = Новый Запрос;
   Запрос.Текст = "ВЫБРАТЬ
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.Ссылка КАК Ссылка,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.НомерСтроки КАК НомерСтроки,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.ФИО КАК ФИО,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.Адрес КАК Адрес,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.СуммаПлатежа КАК СуммаПлатежа,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.ПлатежноеПоручение КАК ПлатежноеПоручение,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.ПериодЗадолженности КАК ПериодЗадолженности
                  |ИЗ
                  |	Документ.ЛаРС_РеестрОплатыИсков.ТаблицаОплат КАК ЛаРС_РеестрОплатыИсковТаблицаОплат
                  |ГДЕ
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.Ссылка = &Ссылка"; //сам текст запроса нам не принципиален
   Запрос.Параметры.Вставить("Ссылка", Ссылка); //в качестве параметра указываем Ссылку – параметр процедуры
   Выборка = Запрос.Выполнить().Выбрать();

   Шапка = Макет.ПолучитьОбласть("Шапка");
   Шапка.Параметры.Заполнить(Ссылка);
   ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
   ТабДок.Очистить();

   ВставлятьРазделительСтраниц = Ложь;
   Шапка.Параметры.Заполнить(Выборка);
   ТабДок.Вывести(Шапка);
   
   ИтогоСуммаПлатежа = 0;
   Пока Выборка.Следующий() Цикл
	   //Если ВставлятьРазделительСтраниц Тогда
	   //    ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	   //КонецЕсли;
	   
	   
	   ОбластьСтрока.Параметры.Заполнить(Выборка);
	   ОбластьСтрока.Параметры.ПредставлениеПП = "ПП №"+ Прав(Выборка.ПлатежноеПоручение.Номер,6) + " от " + Формат(Выборка.ПлатежноеПоручение.Дата,"ДФ=dd.MM.yyyy; ДЛФ=D");
	   ИтогоСуммаПлатежа = ИтогоСуммаПлатежа + Выборка.СуммаПлатежа;
	   ТабДок.Вывести(ОбластьСтрока);
   КонецЦикла;

   Подвал = Макет.ПолучитьОбласть("Подвал");
   Подвал.Параметры.ИтогоСуммаПлатежа = ИтогоСуммаПлатежа;
   ТабДок.Вывести(Подвал);
   
//   ВставлятьРазделительСтраниц = Истина;
   
КонецПроцедуры 

Процедура ПечатьРеестраПени(ТабДок, Ссылка) Экспорт
   Макет = Документы.ЛаРС_РеестрОплатыИсков.ПолучитьМакет("ПФ_MXL_РеестрОплатыПени");
   Запрос = Новый Запрос;
   Запрос.Текст = "ВЫБРАТЬ
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.Ссылка КАК Ссылка,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.НомерСтроки КАК НомерСтроки,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.ФИО КАК ФИО,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.Адрес КАК Адрес,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.СуммаПени КАК СуммаПени,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.ПлатежноеПоручение КАК ПлатежноеПоручение,
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.ПериодЗадолженности КАК ПериодЗадолженности
                  |ИЗ
                  |	Документ.ЛаРС_РеестрОплатыИсков.ТаблицаОплат КАК ЛаРС_РеестрОплатыИсковТаблицаОплат
                  |ГДЕ
                  |	ЛаРС_РеестрОплатыИсковТаблицаОплат.Ссылка = &Ссылка
                  |	И ЛаРС_РеестрОплатыИсковТаблицаОплат.СуммаПени > 0"; //сам текст запроса нам не принципиален
   Запрос.Параметры.Вставить("Ссылка", Ссылка); //в качестве параметра указываем Ссылку – параметр процедуры
   Выборка = Запрос.Выполнить().Выбрать();

   Шапка = Макет.ПолучитьОбласть("Шапка");
   Шапка.Параметры.Заполнить(Ссылка);
   ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
   ТабДок.Очистить();

   ВставлятьРазделительСтраниц = Ложь;
   Шапка.Параметры.Заполнить(Выборка);
   ТабДок.Вывести(Шапка);
   
   ИтогоСуммаПлатежа = 0;
   Пока Выборка.Следующий() Цикл
	   //Если ВставлятьРазделительСтраниц Тогда
	   //    ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	   //КонецЕсли;
	   
	   
	   ОбластьСтрока.Параметры.Заполнить(Выборка);
	   ОбластьСтрока.Параметры.ПредставлениеПП = "ПП №"+ Прав(Выборка.ПлатежноеПоручение.Номер,6) + " от " + Формат(Выборка.ПлатежноеПоручение.Дата,"ДФ=dd.MM.yyyy; ДЛФ=D");
	   ИтогоСуммаПлатежа = ИтогоСуммаПлатежа + Выборка.СуммаПени;
	   ТабДок.Вывести(ОбластьСтрока);
   КонецЦикла;

   Подвал = Макет.ПолучитьОбласть("Подвал");
   Подвал.Параметры.ИтогоСуммаПлатежа = ИтогоСуммаПлатежа;
   ТабДок.Вывести(Подвал);
   
//   ВставлятьРазделительСтраниц = Истина;
   
КонецПроцедуры
